src/cf/Documents/мвв_ПредварительныйРасчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>мвв_ПредварительныйРасчет</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.мвв_Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияПродукта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.мвв_ВерсииСтраховыхПродуктовДСП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетВыполнен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействуетДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПремии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеДляРасчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Раздел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.мвв_РазделыСвойствОбъектов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.мвв_СвойстваОбъектов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеСвойства</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.мвв_СвойстваОбъектов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СтруктураРасчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.мвв_ТаблицыСтруктурыТарифа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ошибка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/мвв_НазначенияСвойствОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>мвв_НазначенияСвойствОбъектов</Name>
			<Comment>(Упр.)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Раздел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.мвв_РазделыСвойствОбъектов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбязателенДляЗаполнения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкиЗаполнения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредставлениеЗаполнения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.мвв_НазначениеСвойствОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.мвв_СвойстваОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Documents/мвв_ПредварительныйРасчет/Ext/ObjectModule.bsl
Процедура ЗаполнитьСвойстваДляРасчета() Экспорт
	ЭтотОбъект.ДанныеДЛяРасчета.Очистить();
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ВерсияПродукта) Тогда 
		ОбщегоНазначения.СообщитьПользователю("Не заполнена версия продукта");
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	мвв_НазначенияСвойствОбъектов.Свойство КАК Свойство,
	               |	мвв_НазначенияСвойствОбъектов.Раздел КАК Раздел,
	               |	мвв_НазначенияСвойствОбъектов.Порядок КАК Порядок
	               |ИЗ
	               |	РегистрСведений.мвв_НазначенияСвойствОбъектов КАК мвв_НазначенияСвойствОбъектов
	               |ГДЕ
	               |	мвв_НазначенияСвойствОбъектов.Объект = &Объект
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Порядок";
	Запрос.УстановитьПараметр("Объект", ЭтотОбъект.ВерсияПродукта);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		тНовСтрока = ЭтотОбъект.ДанныеДЛяРасчета.Добавить();
		ЗаполнитьЗначенияСвойств(тНовСтрока, Выборка);
	КонецЦикла;	
КонецПроцедуры  

Процедура РассчитатьПремиюНаСервере() Экспорт
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ВерсияПродукта) Тогда 
		ОбщегоНазначения.СообщитьПользователю("Не заполнена версия продукта");
		Возврат;
	КонецЕсли;
	
	Версия = ЭтотОбъект.ВерсияПродукта.ПолучитьОбъект();
	сИтог = Новый Структура();
	Попытка
		Версия.ВыполнитьПредварительныйРасчет(ЭтотОбъект.ДанныеДляРасчета.Выгрузить(), ЭтотОбъект.СтруктураРасчета, сИтог);
	Исключение
		ОбщегоНазначения.СообщитьПользователю("Ошибка при выполнении расчета: "+ОписаниеОшибки());
	КонецПопытки;
	
	ЭтотОбъект.РасчетВыполнен 	= сИтог.РасчетВыполнен;
	ЭтотОбъект.СуммаПремии	  	= сИтог.СуммаПремии; 
	ЭтотОбъект.ДействуетДо		= сИТог.ДействуетДо;
КонецПроцедуры
